sketch-maker-backend/app/controllers/sketches_controller.rb

SELECT "sketches".* FROM "sketches"
---
    def index
        sketches = Sketch.all

SELECT "sketches".* FROM "sketches" WHERE "sketches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        sketch = Sketch.find_by_id(params[:id])

SELECT "sketches".* FROM "sketches" ORDER BY "sketches"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def create
        sketch = Sketch.last