backend/app/controllers/sketches_controller.rb

SELECT  "sketches".* FROM "sketches" ORDER BY "sketches"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def index
        sketches = Sketch.all

SELECT  "sketches".* FROM "sketches" ORDER BY "sketches"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def create
        sketch = Sketch.last #for debugging only

SELECT  "sketches".* FROM "sketches" WHERE "sketches"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
    def show
        sketch = Sketch.find_by_id(params[:id])