backend/app/controllers/sketches_controller.rb

SELECT  "sketches".* FROM "sketches" ORDER BY "sketches"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def show
        sketch = Sketch.last